In [316]:
import pandas as pd
import numpy as np

In [317]:
forum_users = {
    'User ID': [1, 2, 3, 4, 5],
    'Username': ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age': [18, 35, 25, 38, None],
    'Joined Date': pd.to_datetime(['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
1        2   jane_smith  35.0  2032-02-15          230         720
2        3      alex123  25.0  2032-04-25           80         200
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [318]:
df.shape

(5, 6)

In [319]:
type(df)

pandas.core.frame.DataFrame

In [320]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [321]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [322]:
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

In [323]:
df.values

array([[1, 'bogdan_s', 18.0, Timestamp('2032-01-01 00:00:00'), 150, 500],
       [2, 'jane_smith', 35.0, Timestamp('2032-02-15 00:00:00'), 230,
        720],
       [3, 'alex123', 25.0, Timestamp('2032-04-25 00:00:00'), 80, 200],
       [4, 'bob56', 38.0, Timestamp('2032-06-21 00:00:00'), 420, 940],
       [5, 'mark_wilson', nan, Timestamp('2032-09-15 00:00:00'), 310,
        500]], dtype=object)

In [324]:
type(df.values)

numpy.ndarray

In [325]:
df.values[1, 1]

'jane_smith'

In [326]:
df.head(3)

   User ID    Username   Age Joined Date  Total Posts  Reputation
0        1    bogdan_s  18.0  2032-01-01          150         500
1        2  jane_smith  35.0  2032-02-15          230         720
2        3     alex123  25.0  2032-04-25           80         200

In [327]:
df.tail(2)

   User ID     Username   Age Joined Date  Total Posts  Reputation
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [328]:
df.describe()

        User ID        Age          Joined Date  Total Posts  Reputation
count  5.000000   4.000000                    5     5.000000    5.000000
mean   3.000000  29.000000  2032-04-28 00:00:00   238.000000  572.000000
min    1.000000  18.000000  2032-01-01 00:00:00    80.000000  200.000000
25%    2.000000  23.250000  2032-02-15 00:00:00   150.000000  500.000000
50%    3.000000  30.000000  2032-04-25 00:00:00   230.000000  500.000000
75%    4.000000  35.750000  2032-06-21 00:00:00   310.000000  720.000000
max    5.000000  38.000000  2032-09-15 00:00:00   420.000000  940.000000
std    1.581139   9.201449                  NaN   133.304163  276.622486

In [329]:
df.isna().sum()

User ID        0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64

In [330]:
df.select_dtypes(include='object').columns

Index(['Username'], dtype='object')

In [331]:
df.select_dtypes(include='int64').columns

Index(['User ID', 'Total Posts', 'Reputation'], dtype='object')

In [332]:
df.select_dtypes(exclude='float64').columns

Index(['User ID', 'Username', 'Joined Date', 'Total Posts', 'Reputation'], dtype='object')

In [333]:
df['Username']

0       bogdan_s
1     jane_smith
2        alex123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [334]:
type(df['Username'])

pandas.core.series.Series

In [335]:
df['Username'].value_counts()

Username
bogdan_s       1
jane_smith     1
alex123        1
bob56          1
mark_wilson    1
Name: count, dtype: int64

In [336]:
df['Reputation'].value_counts(ascending=True)

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [337]:
df['Reputation'].unique()

array([500, 720, 200, 940])

In [338]:
df['Username'].sort_values()

2        alex123
3          bob56
0       bogdan_s
1     jane_smith
4    mark_wilson
Name: Username, dtype: object

In [339]:
df[['Username', 'Age']]

      Username   Age
0     bogdan_s  18.0
1   jane_smith  35.0
2      alex123  25.0
3        bob56  38.0
4  mark_wilson   NaN

In [340]:
df.loc[3]

User ID                          4
Username                     bob56
Age                           38.0
Joined Date    2032-06-21 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [341]:
df.loc[2:3]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3  alex123  25.0  2032-04-25           80         200
3        4    bob56  38.0  2032-06-21          420         940

In [342]:
df.loc[1:3, ['Age', 'Total Posts']]

    Age  Total Posts
1  35.0          230
2  25.0           80
3  38.0          420

In [343]:
df.iloc[3]

User ID                          4
Username                     bob56
Age                           38.0
Joined Date    2032-06-21 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [344]:
df.iloc[2:4]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3  alex123  25.0  2032-04-25           80         200
3        4    bob56  38.0  2032-06-21          420         940

In [345]:
df.iloc[:, 1:4]

      Username   Age Joined Date
0     bogdan_s  18.0  2032-01-01
1   jane_smith  35.0  2032-02-15
2      alex123  25.0  2032-04-25
3        bob56  38.0  2032-06-21
4  mark_wilson   NaN  2032-09-15

In [346]:
df[df['Reputation'] == 500]

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
4        5  mark_wilson   NaN  2032-09-15          310         500

In [347]:
df[df['Total Posts'] >= 200]

   User ID     Username   Age Joined Date  Total Posts  Reputation
1        2   jane_smith  35.0  2032-02-15          230         720
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [348]:
df[(df['Total Posts'] >= 200) & (df['Age'] >= 36)]

   User ID Username   Age Joined Date  Total Posts  Reputation
3        4    bob56  38.0  2032-06-21          420         940

In [349]:
df[(df['Total Posts'] >= 200) | (df['Age'] >= 36)]

   User ID     Username   Age Joined Date  Total Posts  Reputation
1        2   jane_smith  35.0  2032-02-15          230         720
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [350]:
df.isin([200, 500])

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False        True
1    False     False  False        False        False       False
2    False     False  False        False        False        True
3    False     False  False        False        False       False
4    False     False  False        False        False        True

In [351]:
df['Reputation'].isin([200, 500])

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [352]:
df[df['Reputation'].isin([200, 500])]

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
2        3      alex123  25.0  2032-04-25           80         200
4        5  mark_wilson   NaN  2032-09-15          310         500

In [353]:
df[df['Total Posts'].isin(range(200, 350))]

   User ID     Username   Age Joined Date  Total Posts  Reputation
1        2   jane_smith  35.0  2032-02-15          230         720
4        5  mark_wilson   NaN  2032-09-15          310         500

In [354]:
date_range = pd.date_range(start='2032-03-01', end='2032-08-01')
df[df['Joined Date'].isin(date_range)]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3  alex123  25.0  2032-04-25           80         200
3        4    bob56  38.0  2032-06-21          420         940

In [355]:
df.sort_values(by='Age', ascending=True)

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s  18.0  2032-01-01          150         500
2        3      alex123  25.0  2032-04-25           80         200
1        2   jane_smith  35.0  2032-02-15          230         720
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [356]:
df.sort_values(by='Joined Date', ascending=False)

   User ID     Username   Age Joined Date  Total Posts  Reputation
4        5  mark_wilson   NaN  2032-09-15          310         500
3        4        bob56  38.0  2032-06-21          420         940
2        3      alex123  25.0  2032-04-25           80         200
1        2   jane_smith  35.0  2032-02-15          230         720
0        1     bogdan_s  18.0  2032-01-01          150         500

In [357]:
df[['User ID', 'Total Posts', 'Reputation']].sort_values(by=2, axis=1, ascending=False)

   Reputation  Total Posts  User ID
0         500          150        1
1         720          230        2
2         200           80        3
3         940          420        4
4         500          310        5

In [358]:
df['Language'] = 'English'
df

   User ID     Username   Age Joined Date  Total Posts  Reputation Language
0        1     bogdan_s  18.0  2032-01-01          150         500  English
1        2   jane_smith  35.0  2032-02-15          230         720  English
2        3      alex123  25.0  2032-04-25           80         200  English
3        4        bob56  38.0  2032-06-21          420         940  English
4        5  mark_wilson   NaN  2032-09-15          310         500  English

In [359]:
df['Active'] = np.array([True, False, False, True, True])
df

,User ID,Username,Age,Joined Date,Total Posts,Reputation,Language,Active
0,1,bogdan_s,18.0,2032-01-01,150,500,English,True
1,2,jane_smith,35.0,2032-02-15,230,720,English,False
2,3,alex123,25.0,2032-04-25,80,200,English,False
3,4,bob56,38.0,2032-06-21,420,940,English,True
4,5,mark_wilson,NaN,2032-09-15,310,500,English,True

In [360]:
df2 = pd.DataFrame({
    'Total Comments': [70, 30, 45, 55, 80]
})
df2

   Total Comments
0              70
1              30
2              45
3              55
4              80

In [367]:
df = pd.concat([df, df2], axis=1)
df

,User ID,Username,Age,Joined Date,Total Posts,Reputation,Language,Active,Total Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,English,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,English,False,30
2,3,alex123,25.0,2032-04-25,80,200,English,False,45
3,4,bob56,38.0,2032-06-21,420,940,English,True,55
4,5,mark_wilson,NaN,2032-09-15,310,500,English,True,80

In [369]:
df.drop(['Language'], axis=1)

,User ID,Username,Age,Joined Date,Total Posts,Reputation,Active,Total Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,False,30
2,3,alex123,25.0,2032-04-25,80,200,False,45
3,4,bob56,38.0,2032-06-21,420,940,True,55
4,5,mark_wilson,NaN,2032-09-15,310,500,True,80

In [370]:
df.drop([2, 3])

,User ID,Username,Age,Joined Date,Total Posts,Reputation,Language,Active,Total Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,English,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,English,False,30
4,5,mark_wilson,NaN,2032-09-15,310,500,English,True,80

In [372]:
df

,User ID,Username,Age,Joined Date,Total Posts,Reputation,Language,Active,Total Comments
0,1,bogdan_s,18.0,2032-01-01,150,500,English,True,70
1,2,jane_smith,35.0,2032-02-15,230,720,English,False,30
2,3,alex123,25.0,2032-04-25,80,200,English,False,45
3,4,bob56,38.0,2032-06-21,420,940,English,True,55
4,5,mark_wilson,NaN,2032-09-15,310,500,English,True,80